In [1]:
import pandas as pd

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

# 1) Read the csv or excel file

In [3]:
df=pd.read_csv("/content/drive/MyDrive/NIR/used_bikes.csv")

In [4]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
144,Royal Enfield Standard 350cc,115000.0,Hyderabad,14900.0,First Owner,3.0,350.0,Royal Enfield
145,Honda CB Shine 125cc Disc,65000.0,Mumbai,2000.0,First Owner,3.0,125.0,Honda
146,Honda CB Unicorn ABS 150cc,99000.0,Mumbai,4000.0,First Owner,2.0,150.0,Honda
147,Yamaha YZF-R15 2.0 150cc,68500.0,Delhi,68500.0,Second Owner,7.0,150.0,Yamaha
148,Yamaha YZF-R15 V3 150cc,140000.0,Delhi,2473.0,First Owner,2.0,150.0,Yamaha

# 2) Change the datatypes of the column and check the memory usage before and after the change in the data types.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float64
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float64
 4   owner       149 non-null    object
 5   age         149 non-null    float64
 6   power       149 non-null    float64
 7   brand       149 non-null    object
dtypes: float64(4), object(4)
memory usage: 9.4+ KB

In [6]:
df["age"].memory_usage(index=False,deep=True)

1192

To know whether a smaller datatype would sufficient enough to accomodate the data in age column, let’s see the maximum and minimum values of this column.

In [8]:
max_age=df["age"].max()
min_age=df["age"].min()
print(max_age)
print(min_age)

16.0
1.0

Since the column only consists of positive values with the max 16 , we can easily downcast the datatype to float16 without losing any information.

In [9]:
df["age"]=df["age"].astype("float16")
df["age"].memory_usage(index=False,deep=True)

298

In [11]:
# For Categorical Columns
df["city"].value_counts()

Delhi            37
Bangalore        36
Mumbai           19
Hyderabad         6
Ahmedabad         4
Vadodara          3
Ernakulam         3
Pune              3
Noida             3
Chennai           2
Faridabad         2
Gurgaon           2
Gorakhpur         2
Jaipur            2
Jalandhar         1
Surat             1
Thrissur          1
Navi Mumbai       1
Gandhidham        1
Visakhapatnam     1
Agra              1
Kolkata           1
Barasat           1
Dharwad           1
Karnal            1
Baripara          1
Bagalkot          1
Hosur             1
Vidisha           1
Lucknow           1
Nadiad            1
Samastipur        1
Allahabad         1
Kochi             1
Nashik            1
Kaithal           1
Mettur            1
Kalyan            1
Ghaziabad         1
Name: city, dtype: int64

There are only limited  unique values,. In such cases where there are a limited number of values, we can use a more compact datatype called Categorical dtype.

In [12]:
df["city"].memory_usage(index=False,deep=True)

9546

If we were to downcast the object type to categorical dtype, the decrease in memory usage would be as follows:

In [16]:
df["city"]=df["city"].astype("category")
df["city"].memory_usage(index=False,deep=True)

3732

# 3) Dump the data into the mysql database.

In [20]:
pip install mysql

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting mysql
  Downloading mysql-0.0.3-py3-none-any.whl (1.2 kB)
Collecting mysqlclient
  Downloading mysqlclient-2.1.0.tar.gz (87 kB)
     |████████████████████████████████| 87 kB 4.7 MB/s
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.1.0-cp37-cp37m-linux_x86_64.whl size=99959 sha256=6a27a050b645ecf54aeffde4ebe7877cb38c1a2ed61ea18824be108932507f4f
  Stored in directory: /root/.cache/pip/wheels/97/d4/df/08cd6e1fa4a8691b268ab254bd0fa589827ab5b65638c010b4
Successfully built mysqlclient
Installing collected packages: mysqlclient, mysql
Successfully installed mysql-0.0.3 mysqlclient-2.1.0

In [23]:
pip install mysql-connector-python

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.7/dist-packages (8.0.29)
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [ ]:
import mysql.connector as msql
from mysql.connector import Error
conn = msql.connect(host='localhost', user='HR',  
                        password='HR')
if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("CREATE DATABASE dummy")

In [ ]:
import mysql.connector as msql
from mysql.connector import Error

conn = mysql.connect(host='localhost', database='dummy', user='HR', password='HR')
if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        cursor.execute('DROP TABLE IF EXISTS dummy;')
        cursor.execute("CREATE TABLE dummy_data(bike_name varchar(255),price int,city varchar(50),kms_driven int,owner varchar(50),age int,power int,brand varchar(50))")
        for i,row in dummy_data.iterrows():
            sql = "INSERT INTO dummy.dummy_data VALUES (%s,%s,%s,%s,%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            conn.commit()